Autodesk.Revit.UI.MacroManagerUI.LaunchMacroManagerDialog(Autodesk.Revit.ApplicationServices.Application)
Launches the Macro manager dialog.
application:
The Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.MacroManagerUI.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.MacroManagerUI
The Macro managing UI.

Autodesk.Revit.UI.MacroManagerUI.LaunchMacroManagerDialog(Autodesk.Revit.ApplicationServices.ControlledApplication)
Launches the Macro manager dialog.
application:
The Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null